from enum import IntEnum


class CandidateStatusEnum(IntEnum):
    """
    Возможные статусы кандидата в системе ОКО.
    - Это НЕ доменные статусы нашего приложения.
    - Это контракт с внешней системой (ОКО).
    - Значения должны строго соответствовать данным в БД ОКО.
    """
    INTERVIEW = 4  # Приглашён на собеседование
    INTERVIEW_AWAIT = 6  # Ожидаем прохождение интервью
    INTERVIEW_PASSED = 7  # Интервью пройдено
    INTERVIEW_ERROR = 8  # Техническая ошибка
    REFUSAL_ERROR = 9  # Отказ от интервью
